In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.5.1'

In [4]:
np.__version__

'1.23.3'

In [25]:
file = pd.read_csv("calificaciones_v2.csv", header=None, index_col=0)
file.head(10)

                  1
0
matricula  11111111
nombre     Alumno 1
grupo          TI11
Materia 1         1
Materia 2         8
Materia 3         1
Materia 4         7
Materia 5         2
Materia 5         2
estado      regular

In [26]:
file.describe()

              1
count       432
unique      113
top     regular
freq         47

In [27]:
file_Transpose = file.T

In [28]:
file_Transpose

,matricula,nombre,grupo,Materia 1,Materia 2,Materia 3,Materia 4,Materia 5,Materia 5,estado,...,matricula,nombre,grupo,Materia 1,Materia 2,Materia 3,Materia 4,Materia 5,Materia 6,estado
1,11111111,Alumno 1,TI11,1,8,1,7,2,2,regular,...,11111158,Alumno 48,IDGS71,4,4,10,6,8,10,regular

In [29]:
file_Transpose.describe()

,matricula,nombre,grupo,Materia 1,Materia 2,Materia 3,Materia 4,Materia 5,Materia 5,estado,...,matricula,nombre,grupo,Materia 1,Materia 2,Materia 3,Materia 4,Materia 5,Materia 6,estado
count,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
unique,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
top,11111111,Alumno 1,TI11,1,8,1,7,2,2,regular,...,11111158,Alumno 48,IDGS71,4,4,10,6,8,10,regular
freq,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1

In [32]:
file.nunique(0)

1    113
dtype: int64

In [43]:
file.index

Index(['matricula', 'nombre', 'grupo', 'Materia 1', 'Materia 2', 'Materia 3',
       'Materia 4', 'Materia 5', 'Materia 5', 'estado',
       ...
       'matricula', 'nombre', 'grupo', 'Materia 1', 'Materia 2', 'Materia 3',
       'Materia 4', 'Materia 5', 'Materia 6', 'estado'],
      dtype='object', name=0, length=434)

In [39]:
file.

matricula    433
11111111     431
dtype: int64